; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v2 ?v9)
             (pred_4 ?v11 ?v5)
             (pred_6 ?v2 ?v5)
             (pred_9 ?v3 ?v2 )
	     (pred_5 ?v2)
             (pred_10 ?v1)
             (pred_3 ?v11)
             (pred_8 ?v5)
             (pred_2 ?v2)
             (pred_1 ?v11)
             (pred_7 ?v2)
             (pred_11 ))



(:action op_1
:parameters (?v7 ?v6 ?v8 ?v13)
:precondition (and (pred_10 ?v7) (pred_10 ?v6) (pred_3 ?v8) (pred_8 ?v13)
          (pred_12 ?v7 ?v6) (pred_4 ?v8 ?v13)
                   (pred_6 ?v6 ?v13) (pred_5 ?v7) 
                   (pred_2 ?v6) (pred_1 ?v8))
:effect (and  (pred_7 ?v6) (not (pred_2 ?v6))))


(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_10 ?v7) (pred_10 ?v4)
               (pred_5 ?v7) (pred_12 ?v7 ?v4) (pred_7 ?v4))
:effect (and (pred_5 ?v4) (not (pred_5 ?v7))))

(:action op_2
:parameters (?v7 ?v8)
:precondition (and (pred_10 ?v7) (pred_3 ?v8) 
                  (pred_5 ?v7) (pred_9 ?v8 ?v7) (pred_11 ))
:effect (and (pred_1 ?v8)
   (not (pred_9 ?v8 ?v7)) (not (pred_11 ))))


(:action op_3
:parameters (?v7 ?v12 ?v10)
:precondition (and (pred_10 ?v7) (pred_3 ?v12) (pred_3 ?v10)
                  (pred_5 ?v7) (pred_1 ?v10) (pred_9 ?v12 ?v7))
:effect (and (pred_1 ?v12) (pred_9 ?v10 ?v7)
        (not (pred_1 ?v10)) (not (pred_9 ?v12 ?v7))))

(:action op_5
:parameters (?v7 ?v8)
:precondition (and (pred_10 ?v7) (pred_3 ?v8) 
                  (pred_5 ?v7) (pred_1 ?v8))
:effect (and (pred_11 ) (pred_9 ?v8 ?v7) (not (pred_1 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_26 obj_09 obj_31 obj_21 obj_23 obj_07 obj_28 obj_08 obj_11 obj_06 obj_14 obj_25 obj_01 obj_10 obj_17 obj_32 obj_27 obj_15 obj_03 obj_20 obj_05 obj_29 obj_18 obj_02 obj_12
    obj_24 obj_13 obj_22
    obj_16 obj_30 obj_19 obj_04
    )

    (:init
       (pred_11)

       (pred_10 obj_26)
       (pred_10 obj_09)
       (pred_10 obj_31)
       (pred_10 obj_21)
       (pred_10 obj_23)
       (pred_10 obj_07)
       (pred_10 obj_28)
       (pred_10 obj_08)
       (pred_10 obj_11)
       (pred_10 obj_06)
       (pred_10 obj_14)
       (pred_10 obj_25)
       (pred_10 obj_01)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_32)
       (pred_10 obj_27)
       (pred_10 obj_15)
       (pred_10 obj_03)
       (pred_10 obj_20)
       (pred_10 obj_05)
       (pred_10 obj_29)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_12)
       (pred_8 obj_24)
       (pred_8 obj_13)
       (pred_8 obj_22)
       (pred_3 obj_16)
       (pred_3 obj_30)
       (pred_3 obj_19)
       (pred_3 obj_04)

       (pred_12 obj_26 obj_07)
       (pred_12 obj_26 obj_09)
       (pred_12 obj_09 obj_28)
       (pred_12 obj_09 obj_31)
       (pred_12 obj_09 obj_26)
       (pred_12 obj_31 obj_08)
       (pred_12 obj_31 obj_21)
       (pred_12 obj_31 obj_09)
       (pred_12 obj_21 obj_11)
       (pred_12 obj_21 obj_23)
       (pred_12 obj_21 obj_31)
       (pred_12 obj_23 obj_06)
       (pred_12 obj_23 obj_21)
       (pred_12 obj_07 obj_14)
       (pred_12 obj_07 obj_28)
       (pred_12 obj_07 obj_26)
       (pred_12 obj_28 obj_25)
       (pred_12 obj_28 obj_08)
       (pred_12 obj_28 obj_09)
       (pred_12 obj_28 obj_07)
       (pred_12 obj_08 obj_01)
       (pred_12 obj_08 obj_11)
       (pred_12 obj_08 obj_31)
       (pred_12 obj_08 obj_28)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_11 obj_21)
       (pred_12 obj_11 obj_08)
       (pred_12 obj_06 obj_17)
       (pred_12 obj_06 obj_23)
       (pred_12 obj_06 obj_11)
       (pred_12 obj_14 obj_32)
       (pred_12 obj_14 obj_25)
       (pred_12 obj_14 obj_07)
       (pred_12 obj_25 obj_27)
       (pred_12 obj_25 obj_01)
       (pred_12 obj_25 obj_28)
       (pred_12 obj_25 obj_14)
       (pred_12 obj_01 obj_15)
       (pred_12 obj_01 obj_10)
       (pred_12 obj_01 obj_08)
       (pred_12 obj_01 obj_25)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_10 obj_17)
       (pred_12 obj_10 obj_11)
       (pred_12 obj_10 obj_01)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_17 obj_06)
       (pred_12 obj_17 obj_10)
       (pred_12 obj_32 obj_05)
       (pred_12 obj_32 obj_27)
       (pred_12 obj_32 obj_14)
       (pred_12 obj_27 obj_29)
       (pred_12 obj_27 obj_15)
       (pred_12 obj_27 obj_25)
       (pred_12 obj_27 obj_32)
       (pred_12 obj_15 obj_18)
       (pred_12 obj_15 obj_03)
       (pred_12 obj_15 obj_01)
       (pred_12 obj_15 obj_27)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_03 obj_10)
       (pred_12 obj_03 obj_15)
       (pred_12 obj_20 obj_12)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_05 obj_29)
       (pred_12 obj_05 obj_32)
       (pred_12 obj_29 obj_18)
       (pred_12 obj_29 obj_27)
       (pred_12 obj_29 obj_05)
       (pred_12 obj_18 obj_02)
       (pred_12 obj_18 obj_15)
       (pred_12 obj_18 obj_29)
       (pred_12 obj_02 obj_12)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_12 obj_20)
       (pred_12 obj_12 obj_02)
       (pred_2 obj_26)
       (pred_2 obj_25)
       (pred_2 obj_03)
       (pred_2 obj_12)
       (pred_6  obj_26 obj_24)
       (pred_6  obj_25 obj_13)
       (pred_6  obj_03 obj_22)
       (pred_6  obj_12 obj_24)
       (pred_7 obj_09)
       (pred_7 obj_31)
       (pred_7 obj_21)
       (pred_7 obj_23)
       (pred_7 obj_07)
       (pred_7 obj_28)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_06)
       (pred_7 obj_14)
       (pred_7 obj_01)
       (pred_7 obj_10)
       (pred_7 obj_17)
       (pred_7 obj_32)
       (pred_7 obj_27)
       (pred_7 obj_15)
       (pred_7 obj_20)
       (pred_7 obj_05)
       (pred_7 obj_29)
       (pred_7 obj_18)
       (pred_7 obj_02)

       (pred_4  obj_16 obj_24)
       (pred_4  obj_30 obj_13)
       (pred_4  obj_19 obj_22)
       (pred_4  obj_04 obj_22)
       (pred_9 obj_16 obj_08)
       (pred_9 obj_30 obj_18)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_04 obj_07)
       (pred_5 obj_17)
    )

    (:goal (and
       (pred_9 obj_16 obj_18)
    ))
(:constraints
  (always (not (pred_5 obj_01)))
)
)

; plan
1. (op_4 obj_17 obj_06)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_11)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_08)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_08)
   goals met: 0 of 1
4. (op_2 obj_08 obj_16)
   deleted: (pred_9 obj_16 obj_08) (pred_11)
   added: (pred_1 obj_16)
   goals met: 0 of 1
5. (op_4 obj_08 obj_11)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_11)
   goals met: 0 of 1
6. (op_4 obj_11 obj_10)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_10)
   goals met: 0 of 1
7. (op_4 obj_10 obj_17)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_17)
   goals met: 0 of 1
8. (op_4 obj_17 obj_20)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_20)
   goals met: 0 of 1
9. (op_1 obj_20 obj_12 obj_16 obj_24)
   deleted: (pred_2 obj_12)
   added: (pred_7 obj_12)
   goals met: 0 of 1
10. (op_4 obj_20 obj_12)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_12)
   goals met: 0 of 1
11. (op_4 obj_12 obj_02)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_02)
   goals met: 0 of 1
12. (op_4 obj_02 obj_18)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_18)
   goals met: 0 of 1
13. (op_3 obj_18 obj_30 obj_16)
   deleted: (pred_1 obj_16) (pred_9 obj_30 obj_18)
   added: (pred_1 obj_30) (pred_9 obj_16 obj_18)
   goals met: 1 of 1
